uched41/BM-Assist/Central/nRF5_SDK_15.3.0_59ac345/examples/ble_central_and_peripheral/experimental/mindAssist/pca10040/s132/arm5_no_packs/ra8875.c
#ifdef RA8875_USE

#include "ra8875.h"
#include "nrf_log.h"
#include "nrf_drv_gpiote.h"
#include "nrf_drv_systick.h"


#define SPI_MISO_PIN 	30
#define SPI_MOSI_PIN 	29
#define SPI_SCK_PIN 	28
#define SPI_SS_PIN 		31
#define RESET_PIN			27

static uint8_t   m_tx_buf[64];           /**< TX buffer. */
static uint8_t   m_rx_buf[64];    /**< RX buffer. */

static const nrf_drv_spi_t spi = NRF_DRV_SPI_INSTANCE(1);  /**< SPI instance. */

void spi_event_handler(nrf_drv_spi_evt_t const * p_event, void * p_context){}

// Initialize display object;	
ra8875_t display = {0};



/**************************************************************************/
/*!
      Constructor for a new RA8875 instance

      @args CS[in]  Location of the SPI chip select pin
      @args RST[in] Location of the reset pin
*/
/**************************************************************************/
void 	init_display (ra8875_t* disp, uint8_t mosi, uint8_t miso, uint8_t sck, uint8_t cs, uint8_t rst){
  disp->_cs = cs;
	disp->_rst = rst;
	disp->_mosi = mosi;
	disp->_miso = miso;
	disp->_sck = sck;
}

/**************************************************************************/
/*!
      Initialises the LCD driver and any HW required by the display

      @args s[in] The display size, which can be either:
                  'RA8875_480x272' (4.3" displays) r
                  'RA8875_800x480' (5" and 7" displays)
*/
/**************************************************************************/
bool display_begin(ra8875_t* disp, enum RA8875sizes s){
  disp->_size = s;

  if (disp->_size == RA8875_480x272) {
    disp->_width = 480;
    disp->_height = 272;
  }
  else if (disp->_size == RA8875_800x480) {
    disp->_width = 800;
    disp->_height = 480;
  }
  else {
    return false;
  }
	
	ret_code_t err_code;
	
	// initialize rst pin
	nrf_drv_gpiote_in_config_t in_config = GPIOTE_CONFIG_IN_SENSE_LOTOHI(true);
	err_code = nrf_drv_gpiote_in_init(disp->_rst, &in_config, NULL);
	APP_ERROR_CHECK(err_code);
	
	// initialize cs pin
	nrf_drv_gpiote_in_config_t in_config_2 = GPIOTE_CONFIG_IN_SENSE_LOTOHI(true);
	err_code = nrf_drv_gpiote_in_init(disp->_cs, &in_config_2, NULL);
	APP_ERROR_CHECK(err_code);
	
	nrf_drv_gpiote_out_set(disp->_cs);
	nrf_drv_gpiote_out_clear(disp->_rst);
	nrfx_systick_delay_ms(100);
	nrf_drv_gpiote_out_set(disp->_rst);
	nrfx_systick_delay_ms(100);

	nrf_drv_spi_config_t spi_config = NRF_DRV_SPI_DEFAULT_CONFIG;
	spi_config.ss_pin   = disp->_cs;
	spi_config.miso_pin = disp->_miso;
	spi_config.mosi_pin = disp->_mosi;
	spi_config.sck_pin  = disp->_sck;
	
	err_code = nrf_drv_spi_init(&spi, &spi_config, NULL, NULL);
	NRF_LOG_INFO("SPI : 0x%04X", err_code);
	APP_ERROR_CHECK(err_code);
	NRF_LOG_INFO("SPI started.");
	
  uint8_t x = readReg(disp, 0);
	NRF_LOG_INFO("X: 0x%02X", x);
	if (x != 0x75) {
		NRF_LOG_INFO("Error initializing display.");
		return false;
	}
	NRF_LOG_INFO("Display initialization complete.");

  /*initialize(disp);
*/
  return true;
}

/************************* Initialization *********************************/

/**************************************************************************/
/*!
      Performs a SW-based reset of the RA8875
*/
/**************************************************************************/
void softReset(ra8875_t* disp) {
  writeCommand(disp, RA8875_PWRR);
  writeData(disp, RA8875_PWRR_SOFTRESET);
  writeData(disp, RA8875_PWRR_NORMAL);
  nrfx_systick_delay_ms(1);
}

/**************************************************************************/
/*!
      Initialise the PLL
*/
/**************************************************************************/
void PLLinit(ra8875_t* disp) {
  if (disp->_size == RA8875_480x272) {
    writeReg(disp, RA8875_PLLC1, RA8875_PLLC1_PLLDIV1 + 10);
    nrfx_systick_delay_ms(1);
    writeReg(disp, RA8875_PLLC2, RA8875_PLLC2_DIV4);
    nrfx_systick_delay_ms(1);
  }
  else /* (_size == RA8875_800x480) */ {
    writeReg(disp, RA8875_PLLC1, RA8875_PLLC1_PLLDIV1 + 10);
    nrfx_systick_delay_ms(1);
    writeReg(disp, RA8875_PLLC2, RA8875_PLLC2_DIV4);
    nrfx_systick_delay_ms(1);
  }
}

/**************************************************************************/
/*!
      Initialises the driver IC (clock setup, etc.)
*/
/**************************************************************************/
void initialize(ra8875_t* disp) {
  PLLinit(disp);
  writeReg(disp, RA8875_SYSR, RA8875_SYSR_16BPP | RA8875_SYSR_MCU8);

  /* Timing values */
  uint8_t pixclk;
  uint8_t hsync_start;
  uint8_t hsync_pw;
  uint8_t hsync_finetune;
  uint8_t hsync_nondisp;
  uint8_t vsync_pw;
  uint16_t vsync_nondisp;
  uint16_t vsync_start;

  /* Set the correct values for the display being used */
  if (disp->_size == RA8875_480x272)
  {
    pixclk          = RA8875_PCSR_PDATL | RA8875_PCSR_4CLK;
    hsync_nondisp   = 10;
    hsync_start     = 8;
    hsync_pw        = 48;
    hsync_finetune  = 0;
    vsync_nondisp   = 3;
    vsync_start     = 8;
    vsync_pw        = 10;
  }
  else // (_size == RA8875_800x480)
  {
    pixclk          = RA8875_PCSR_PDATL | RA8875_PCSR_2CLK;
    hsync_nondisp   = 26;
    hsync_start     = 32;
    hsync_pw        = 96;
    hsync_finetune  = 0;
    vsync_nondisp   = 32;
    vsync_start     = 23;
    vsync_pw        = 2;
  }

  writeReg(disp, RA8875_PCSR, pixclk);
  nrfx_systick_delay_ms(1);

  /* Horizontal settings registers */
  writeReg(disp, RA8875_HDWR, (disp->_width / 8) - 1);                          // H width: (HDWR + 1) * 8 = 480
  writeReg(disp, RA8875_HNDFTR, RA8875_HNDFTR_DE_HIGH + hsync_finetune);
  writeReg(disp, RA8875_HNDR, (hsync_nondisp - hsync_finetune - 2)/8);    // H non-display: HNDR * 8 + HNDFTR + 2 = 10
  writeReg(disp, RA8875_HSTR, hsync_start/8 - 1);                         // Hsync start: (HSTR + 1)*8
  writeReg(disp, RA8875_HPWR, RA8875_HPWR_LOW + (hsync_pw/8 - 1));        // HSync pulse width = (HPWR+1) * 8

  /* Vertical settings registers */
  writeReg(disp, RA8875_VDHR0, (uint16_t)(disp->_height - 1) & 0xFF);
  writeReg(disp, RA8875_VDHR1, (uint16_t)(disp->_height - 1) >> 8);
  writeReg(disp, RA8875_VNDR0, vsync_nondisp-1);                          // V non-display period = VNDR + 1
  writeReg(disp, RA8875_VNDR1, vsync_nondisp >> 8);
  writeReg(disp, RA8875_VSTR0, vsync_start-1);                            // Vsync start position = VSTR + 1
  writeReg(disp, RA8875_VSTR1, vsync_start >> 8);
  writeReg(disp, RA8875_VPWR, RA8875_VPWR_LOW + vsync_pw - 1);            // Vsync pulse width = VPWR + 1

  /* Set active window X */
  writeReg(disp, RA8875_HSAW0, 0);                                        // horizontal start point
  writeReg(disp, RA8875_HSAW1, 0);
  writeReg(disp, RA8875_HEAW0, (uint16_t)(disp->_width - 1) & 0xFF);            // horizontal end point
  writeReg(disp, RA8875_HEAW1, (uint16_t)(disp->_width - 1) >> 8);

  /* Set active window Y */
  writeReg(disp, RA8875_VSAW0, 0);                                        // vertical start point
  writeReg(disp, RA8875_VSAW1, 0);
  writeReg(disp, RA8875_VEAW0, (uint16_t)(disp->_height - 1) & 0xFF);           // horizontal end point
  writeReg(disp, RA8875_VEAW1, (uint16_t)(disp->_height - 1) >> 8);

