uched41/BM-Assist/Central/nRF5_SDK_15.3.0_59ac345/examples/ble_central_and_peripheral/experimental/mindAssist/pca10040/s132/arm5_no_packs/ra8875.c
  /* ToDo: Setup touch panel? */

  /* Clear the entire window */
  writeReg(disp, RA8875_MCLR, RA8875_MCLR_START | RA8875_MCLR_FULL);
  nrfx_systick_delay_ms(500);
}

/**************************************************************************/
/*!
      Returns the display width in pixels

      @returns  The 1-based display width in pixels
*/
/**************************************************************************/
uint16_t width(ra8875_t* disp) { return disp->_width; }

/**************************************************************************/
/*!
      Returns the display height in pixels

      @returns  The 1-based display height in pixels
*/
/**************************************************************************/
uint16_t height(ra8875_t* disp) { return disp->_height; }

/************************* Text Mode ***********************************/

/**************************************************************************/
/*!
      Sets the display in text mode (as opposed to graphics mode)
*/
/**************************************************************************/
void textMode(ra8875_t* disp)
{
  /* Set text mode */
  writeCommand(disp, RA8875_MWCR0);
  uint8_t temp = readData(disp);
  temp |= RA8875_MWCR0_TXTMODE; // Set bit 7
  writeData(disp, temp);

  /* Select the internal (ROM) font */
  writeCommand(disp, 0x21);
  temp = readData(disp);
  temp &= ~((1<<7) | (1<<5)); // Clear bits 7 and 5
  writeData(disp, temp);
}

/**************************************************************************/
/*!
      Sets the display in text mode (as opposed to graphics mode)

      @args x[in] The x position of the cursor (in pixels, 0..1023)
      @args y[in] The y position of the cursor (in pixels, 0..511)
*/
/**************************************************************************/
void textSetCursor(ra8875_t* disp, uint16_t x, uint16_t y)
{
  /* Set cursor location */
  writeCommand(disp, 0x2A);
  writeData(disp, x & 0xFF);
  writeCommand(disp, 0x2B);
  writeData(disp, x >> 8);
  writeCommand(disp, 0x2C);
  writeData(disp, y & 0xFF);
  writeCommand(disp, 0x2D);
  writeData(disp, y >> 8);
}

/**************************************************************************/
/*!
      Sets the fore and background color when rendering text

      @args foreColor[in] The RGB565 color to use when rendering the text
      @args bgColor[in]   The RGB565 colot to use for the background
*/
/**************************************************************************/
void textColor(ra8875_t* disp, uint16_t foreColor, uint16_t bgColor)
{
  /* Set Fore Color */
  writeCommand(disp, 0x63);
  writeData(disp, (foreColor & 0xf800) >> 11);
  writeCommand(disp, 0x64);
  writeData(disp, (foreColor & 0x07e0) >> 5);
  writeCommand(disp, 0x65);
  writeData(disp, (foreColor & 0x001f));

  /* Set Background Color */
  writeCommand(disp, 0x60);
  writeData(disp, (bgColor & 0xf800) >> 11);
  writeCommand(disp, 0x61);
  writeData(disp, (bgColor & 0x07e0) >> 5);
  writeCommand(disp, 0x62);
  writeData(disp, (bgColor & 0x001f));

  /* Clear transparency flag */
  writeCommand(disp, 0x22);
  uint8_t temp = readData(disp);
  temp &= ~(1<<6); // Clear bit 6
  writeData(disp, temp);
}

/**************************************************************************/
/*!
      Sets the fore color when rendering text with a transparent bg

      @args foreColor[in] The RGB565 color to use when rendering the text
*/
/**************************************************************************/
void textTransparent(ra8875_t* disp, uint16_t foreColor)
{
  /* Set Fore Color */
  writeCommand(disp, 0x63);
  writeData(disp, (foreColor & 0xf800) >> 11);
  writeCommand(disp, 0x64);
  writeData(disp, (foreColor & 0x07e0) >> 5);
  writeCommand(disp, 0x65);
  writeData(disp, (foreColor & 0x001f));

  /* Set transparency flag */
  writeCommand(disp, 0x22);
  uint8_t temp = readData(disp);
  temp |= (1<<6); // Set bit 6
  writeData(disp, temp);
}

/**************************************************************************/
/*!
      Sets the text enlarge settings, using one of the following values:

      0 = 1x zoom
      1 = 2x zoom
      2 = 3x zoom
      3 = 4x zoom

      @args scale[in]   The zoom factor (0..3 for 1-4x zoom)
*/
/**************************************************************************/
void textEnlarge(ra8875_t* disp, uint8_t scale)
{
  if (scale > 3) scale = 3;

  /* Set font size flags */
  writeCommand(disp, 0x22);
  uint8_t temp = readData(disp);
  temp &= ~(0xF); // Clears bits 0..3
  temp |= scale << 2;
  temp |= scale;
  writeData(disp, temp);

  disp->_textScale = scale;
}

/**************************************************************************/
/*!
      Renders some text on the screen when in text mode

      @args buffer[in]    The buffer containing the characters to render
      @args len[in]       The size of the buffer in bytes
*/
/**************************************************************************/
void textWrite(ra8875_t* disp, const char* buffer, uint16_t len)
{
  if (len == 0) len = strlen(buffer);
  writeCommand(disp, RA8875_MRWC);
  for (uint16_t i=0;i<len;i++)
  {
    writeData(disp, buffer[i]);
#if defined(__arm__)
    // This delay is needed with textEnlarge(1) because
    // Teensy 3.X is much faster than Arduino Uno
    if (disp->_textScale > 0) nrfx_systick_delay_ms(1);
#else
    // For others, delay starting with textEnlarge(2)
    if (_textScale > 1) delay(1);
#endif
  }
}

/************************* Graphics ***********************************/

/**************************************************************************/
/*!
      Sets the display in graphics mode (as opposed to text mode)
*/
/**************************************************************************/
void graphicsMode(ra8875_t* disp) {
  writeCommand(disp, RA8875_MWCR0);
  uint8_t temp = readData(disp);
  temp &= ~RA8875_MWCR0_TXTMODE; // bit #7
  writeData(disp, temp);
}

/**************************************************************************/
/*!
      Waits for screen to finish by polling the status!
*/
/**************************************************************************/
bool waitPoll(ra8875_t* disp, uint8_t regname, uint8_t waitflag) {
  /* Wait for the command to finish */
  while (1)
  {
    uint8_t temp = readReg(disp, regname);
    if (!(temp & waitflag))
      return true;
  }
  return false; // MEMEFIX: yeah i know, unreached! - add timeout?
}


/**************************************************************************/
/*!
      Sets the current X/Y position on the display before drawing

