uched41/BM-Assist/Central/nRF5_SDK_15.3.0_59ac345/examples/ble_central_and_peripheral/experimental/mindAssist/pca10040/s132/arm5_no_packs/ra8875.c
      @args x[in] The 0-based x location
      @args y[in] The 0-base y location
*/
/**************************************************************************/
void setXY(ra8875_t* disp, uint16_t x, uint16_t y) {
  writeReg(disp, RA8875_CURH0, x);
  writeReg(disp, RA8875_CURH1, x >> 8);
  writeReg(disp, RA8875_CURV0, y);
  writeReg(disp, RA8875_CURV1, y >> 8);
}


/**************************************************************************/
/*!

*/
/**************************************************************************/
void fillRect(ra8875_t* disp) {
  writeCommand(disp, RA8875_DCR);
  writeData(disp, RA8875_DCR_LINESQUTRI_STOP | RA8875_DCR_DRAWSQUARE);
  writeData(disp, RA8875_DCR_LINESQUTRI_START | RA8875_DCR_FILL | RA8875_DCR_DRAWSQUARE);
}

/**************************************************************************/
/*!
      Draws a single pixel at the specified location

      @args x[in]     The 0-based x location
      @args y[in]     The 0-base y location
      @args color[in] The RGB565 color to use when drawing the pixel
*/
/**************************************************************************/
void drawPixel(ra8875_t* disp, int16_t x, int16_t y, uint16_t color)
{
  writeReg(disp, RA8875_CURH0, x);
  writeReg(disp, RA8875_CURH1, x >> 8);
  writeReg(disp, RA8875_CURV0, y);
  writeReg(disp, RA8875_CURV1, y >> 8);
  writeCommand(disp, RA8875_MRWC);
	
	uint8_t dat[3];
	dat[0] = RA8875_DATAWRITE;
	dat[1] = color >> 8;
	dat[2] = color;
	
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, dat, 3, m_rx_buf, 3));
}

/**************************************************************************/
/*!
 Draws a series of pixels at the specified location without the overhead

 @args p[in]     An array of RGB565 color pixels
 @args num[in]   The number of the pixels to draw
 @args x[in]     The 0-based x location
 @args y[in]     The 0-base y location
 */
/**************************************************************************/
void drawPixels(ra8875_t* disp, uint16_t * p, uint32_t num, int16_t x, int16_t y)
{
    writeReg(disp, RA8875_CURH0, x);
    writeReg(disp, RA8875_CURH1, x >> 8);
    writeReg(disp, RA8875_CURV0, y);
    writeReg(disp, RA8875_CURV1, y >> 8);
    writeCommand(disp, RA8875_MRWC);
	
		uint16_t tlen = num*2+1;
	
		uint8_t dat[tlen];
	  dat[0] = RA8875_DATAWRITE;
		uint16_t ptr = 1;
	  while (num--) {
			dat[ptr++] = (*p >> 8);
			dat[ptr++] = (*p & 0xFF);
			p++;
    }
	 
		APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, dat, tlen, m_rx_buf, tlen));
}

/**************************************************************************/
/*!
      Draws a HW accelerated line on the display

      @args x0[in]    The 0-based starting x location
      @args y0[in]    The 0-base starting y location
      @args x1[in]    The 0-based ending x location
      @args y1[in]    The 0-base ending y location
      @args color[in] The RGB565 color to use when drawing the pixel
*/
/**************************************************************************/
void drawLine(ra8875_t* disp, int16_t x0, int16_t y0, int16_t x1, int16_t y1, uint16_t color)
{
  /* Set X */
  writeCommand(disp, 0x91);
  writeData(disp, x0);
  writeCommand(disp, 0x92);
  writeData(disp, x0 >> 8);

  /* Set Y */
  writeCommand(disp, 0x93);
  writeData(disp, y0);
  writeCommand(disp, 0x94);
  writeData(disp, y0 >> 8);

  /* Set X1 */
  writeCommand(disp, 0x95);
  writeData(disp, x1);
  writeCommand(disp, 0x96);
  writeData(disp, (x1) >> 8);

  /* Set Y1 */
  writeCommand(disp, 0x97);
  writeData(disp, y1);
  writeCommand(disp, 0x98);
  writeData(disp, (y1) >> 8);

  /* Set Color */
  writeCommand(disp, 0x63);
  writeData(disp, (color & 0xf800) >> 11);
  writeCommand(disp, 0x64);
  writeData(disp, (color & 0x07e0) >> 5);
  writeCommand(disp, 0x65);
  writeData(disp, (color & 0x001f));

  /* Draw! */
  writeCommand(disp, RA8875_DCR);
  writeData(disp, 0x80);

  /* Wait for the command to finish */
  waitPoll(disp, RA8875_DCR, RA8875_DCR_LINESQUTRI_STATUS);
}

/**************************************************************************/
/*!

*/
/**************************************************************************/
void drawFastVLine(ra8875_t* disp, int16_t x, int16_t y, int16_t h, uint16_t color)
{
  drawLine(disp, x, y, x, y+h, color);
}

/**************************************************************************/
/*!

*/
/**************************************************************************/
void drawFastHLine(ra8875_t* disp, int16_t x, int16_t y, int16_t w, uint16_t color)
{
  drawLine(disp, x, y, x+w, y, color);
}

/**************************************************************************/
/*!
      Draws a HW accelerated rectangle on the display

      @args x[in]     The 0-based x location of the top-right corner
      @args y[in]     The 0-based y location of the top-right corner
      @args w[in]     The rectangle width
      @args h[in]     The rectangle height
      @args color[in] The RGB565 color to use when drawing the pixel
*/
/**************************************************************************/
void drawRect(ra8875_t* disp, int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color)
{
  rectHelper(disp, x, y, x+w, y+h, color, false);
}

/**************************************************************************/
/*!
      Draws a HW accelerated filled rectangle on the display

      @args x[in]     The 0-based x location of the top-right corner
      @args y[in]     The 0-based y location of the top-right corner
      @args w[in]     The rectangle width
      @args h[in]     The rectangle height
      @args color[in] The RGB565 color to use when drawing the pixel
*/
/**************************************************************************/
void fillRect_2(ra8875_t* disp, int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color)
{
  rectHelper(disp, x, y, x+w, y+h, color, true);
}

/**************************************************************************/
/*!
      Fills the screen with the spefied RGB565 color

