uched41/BM-Assist/Central/nRF5_SDK_15.3.0_59ac345/examples/ble_central_and_peripheral/experimental/mindAssist/pca10040/s132/arm5_no_packs/ra8875.c
  /* Set Color */
  writeCommand(disp, 0x63);
  writeData(disp, (color & 0xf800) >> 11);
  writeCommand(disp, 0x64);
  writeData(disp, (color & 0x07e0) >> 5);
  writeCommand(disp, 0x65);
  writeData(disp, (color & 0x001f));

  /* Draw! */
  writeCommand(disp, RA8875_DCR);
  if (filled)
  {
    writeData(disp, RA8875_DCR_CIRCLE_START | RA8875_DCR_FILL);
  }
  else
  {
    writeData(disp, RA8875_DCR_CIRCLE_START | RA8875_DCR_NOFILL);
  }

  /* Wait for the command to finish */
  waitPoll(disp, RA8875_DCR, RA8875_DCR_CIRCLE_STATUS);
}

/**************************************************************************/
/*!
      Helper function for higher level rectangle drawing code
*/
/**************************************************************************/
void rectHelper(ra8875_t* disp, int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color, bool filled)
{
  /* Set X */
  writeCommand(disp, 0x91);
  writeData(disp, x);
  writeCommand(disp, 0x92);
  writeData(disp, x >> 8);

  /* Set Y */
  writeCommand(disp, 0x93);
  writeData(disp, y);
  writeCommand(disp, 0x94);
  writeData(disp, y >> 8);

  /* Set X1 */
  writeCommand(disp, 0x95);
  writeData(disp, w);
  writeCommand(disp, 0x96);
  writeData(disp, (w) >> 8);

  /* Set Y1 */
  writeCommand(disp, 0x97);
  writeData(disp, h);
  writeCommand(disp, 0x98);
  writeData(disp, (h) >> 8);

  /* Set Color */
  writeCommand(disp, 0x63);
  writeData(disp, (color & 0xf800) >> 11);
  writeCommand(disp, 0x64);
  writeData(disp, (color & 0x07e0) >> 5);
  writeCommand(disp, 0x65);
  writeData(disp, (color & 0x001f));

  /* Draw! */
  writeCommand(disp, RA8875_DCR);
  if (filled)
  {
    writeData(disp, 0xB0);
  }
  else
  {
    writeData(disp, 0x90);
  }

  /* Wait for the command to finish */
  waitPoll(disp, RA8875_DCR, RA8875_DCR_LINESQUTRI_STATUS);
}

/**************************************************************************/
/*!
      Helper function for higher level triangle drawing code
*/
/**************************************************************************/
void triangleHelper(ra8875_t* disp, int16_t x0, int16_t y0, int16_t x1, int16_t y1, int16_t x2, int16_t y2, uint16_t color, bool filled)
{
  /* Set Point 0 */
  writeCommand(disp, 0x91);
  writeData(disp, x0);
  writeCommand(disp, 0x92);
  writeData(disp, x0 >> 8);
  writeCommand(disp, 0x93);
  writeData(disp, y0);
  writeCommand(disp, 0x94);
  writeData(disp, y0 >> 8);

  /* Set Point 1 */
  writeCommand(disp, 0x95);
  writeData(disp, x1);
  writeCommand(disp, 0x96);
  writeData(disp, x1 >> 8);
  writeCommand(disp, 0x97);
  writeData(disp, y1);
  writeCommand(disp, 0x98);
  writeData(disp, y1 >> 8);

  /* Set Point 2 */
  writeCommand(disp, 0xA9);
  writeData(disp, x2);
  writeCommand(disp, 0xAA);
  writeData(disp, x2 >> 8);
  writeCommand(disp, 0xAB);
  writeData(disp, y2);
  writeCommand(disp, 0xAC);
  writeData(disp, y2 >> 8);

  /* Set Color */
  writeCommand(disp, 0x63);
  writeData(disp, (color & 0xf800) >> 11);
  writeCommand(disp, 0x64);
  writeData(disp, (color & 0x07e0) >> 5);
  writeCommand(disp, 0x65);
  writeData(disp, (color & 0x001f));

  /* Draw! */
  writeCommand(disp, RA8875_DCR);
  if (filled)
  {
    writeData(disp, 0xA1);
  }
  else
  {
    writeData(disp, 0x81);
  }

  /* Wait for the command to finish */
  waitPoll(disp, RA8875_DCR, RA8875_DCR_LINESQUTRI_STATUS);
}

/**************************************************************************/
/*!
      Helper function for higher level ellipse drawing code
*/
/**************************************************************************/
void ellipseHelper(ra8875_t* disp, int16_t xCenter, int16_t yCenter, int16_t longAxis, int16_t shortAxis, uint16_t color, bool filled)
{
  /* Set Center Point */
  writeCommand(disp, 0xA5);
  writeData(disp, xCenter);
  writeCommand(disp, 0xA6);
  writeData(disp, xCenter >> 8);
  writeCommand(disp, 0xA7);
  writeData(disp, yCenter);
  writeCommand(disp, 0xA8);
  writeData(disp, yCenter >> 8);

  /* Set Long and Short Axis */
  writeCommand(disp, 0xA1);
  writeData(disp, longAxis);
  writeCommand(disp, 0xA2);
  writeData(disp, longAxis >> 8);
  writeCommand(disp, 0xA3);
  writeData(disp, shortAxis);
  writeCommand(disp, 0xA4);
  writeData(disp, shortAxis >> 8);

  /* Set Color */
  writeCommand(disp, 0x63);
  writeData(disp, (color & 0xf800) >> 11);
  writeCommand(disp, 0x64);
  writeData(disp, (color & 0x07e0) >> 5);
  writeCommand(disp, 0x65);
  writeData(disp, (color & 0x001f));

  /* Draw! */
  writeCommand(disp, 0xA0);
  if (filled)
  {
    writeData(disp, 0xC0);
  }
  else
  {
    writeData(disp, 0x80);
  }

  /* Wait for the command to finish */
  waitPoll(disp, RA8875_ELLIPSE, RA8875_ELLIPSE_STATUS);
}

/**************************************************************************/
/*!
      Helper function for higher level curve drawing code
*/
/**************************************************************************/
void curveHelper(ra8875_t* disp, int16_t xCenter, int16_t yCenter, int16_t longAxis, int16_t shortAxis, uint8_t curvePart, uint16_t color, bool filled)
{
  /* Set Center Point */
  writeCommand(disp, 0xA5);
  writeData(disp, xCenter);
  writeCommand(disp, 0xA6);
  writeData(disp, xCenter >> 8);
  writeCommand(disp, 0xA7);
  writeData(disp, yCenter);
  writeCommand(disp, 0xA8);
  writeData(disp, yCenter >> 8);

  /* Set Long and Short Axis */
  writeCommand(disp, 0xA1);
  writeData(disp, longAxis);
  writeCommand(disp, 0xA2);
  writeData(disp, longAxis >> 8);
  writeCommand(disp, 0xA3);
  writeData(disp, shortAxis);
  writeCommand(disp, 0xA4);
  writeData(disp, shortAxis >> 8);

  /* Set Color */
  writeCommand(disp, 0x63);
  writeData(disp, (color & 0xf800) >> 11);
  writeCommand(disp, 0x64);
  writeData(disp, (color & 0x07e0) >> 5);
  writeCommand(disp, 0x65);
  writeData(disp, (color & 0x001f));

  /* Draw! */
  writeCommand(disp, 0xA0);
  if (filled)
  {
    writeData(disp, 0xD0 | (curvePart & 0x03));
  }
  else
  {
    writeData(disp, 0x90 | (curvePart & 0x03));
  }

  /* Wait for the command to finish */
  waitPoll(disp, RA8875_ELLIPSE, RA8875_ELLIPSE_STATUS);
}

/************************* Mid Level ***********************************/

/**************************************************************************/
/*!

*/
/**************************************************************************/
void GPIOX(ra8875_t* disp, bool on) {
  if (on)
    writeReg(disp, RA8875_GPIOX, 1);
  else
    writeReg(disp, RA8875_GPIOX, 0);
}

/**************************************************************************/
/*!

*/
/**************************************************************************/
void PWM1out(ra8875_t* disp, uint8_t p) {
  writeReg(disp, RA8875_P1DCR, p);
}

/**************************************************************************/
/*!

*/
/**************************************************************************/
void PWM2out(ra8875_t* disp, uint8_t p) {
  writeReg(disp, RA8875_P2DCR, p);
}

/**************************************************************************/
/*!

*/
/**************************************************************************/
void PWM1config(ra8875_t* disp, bool on, uint8_t clock) {
  if (on) {
    writeReg(disp, RA8875_P1CR, RA8875_P1CR_ENABLE | (clock & 0xF));
  } else {
    writeReg(disp, RA8875_P1CR, RA8875_P1CR_DISABLE | (clock & 0xF));
  }
}

/**************************************************************************/
/*!

*/
/**************************************************************************/
void PWM2config(ra8875_t* disp, bool on, uint8_t clock) {
  if (on) {
    writeReg(disp, RA8875_P2CR, RA8875_P2CR_ENABLE | (clock & 0xF));
  } else {
    writeReg(disp, RA8875_P2CR, RA8875_P2CR_DISABLE | (clock & 0xF));
  }
}

/**************************************************************************/
/*!
      Enables or disables the on-chip touch screen controller
*/
/**************************************************************************/
void touchEnable(ra8875_t* disp, bool on)
{
  uint8_t   adcClk = (uint8_t) RA8875_TPCR0_ADCCLK_DIV4;

  if ( disp->_size == RA8875_800x480 ) //match up touch size with LCD size
    adcClk = (uint8_t) RA8875_TPCR0_ADCCLK_DIV16;

  if (on)
  {
    /* Enable Touch Panel (Reg 0x70) */
    writeReg(disp, RA8875_TPCR0, RA8875_TPCR0_ENABLE        |
                           RA8875_TPCR0_WAIT_4096CLK  |
                           RA8875_TPCR0_WAKEENABLE   |
                           adcClk); // 10mhz max!
    /* Set Auto Mode      (Reg 0x71) */
    writeReg(disp, RA8875_TPCR1, RA8875_TPCR1_AUTO    |
                           // RA8875_TPCR1_VREFEXT |
                           RA8875_TPCR1_DEBOUNCE);
    /* Enable TP INT */
    writeReg(disp, RA8875_INTC1, readReg(disp, RA8875_INTC1) | RA8875_INTC1_TP);
  }
  else
  {
    /* Disable TP INT */
    writeReg(disp, RA8875_INTC1, readReg(disp, RA8875_INTC1) & ~RA8875_INTC1_TP);
    /* Disable Touch Panel (Reg 0x70) */
    writeReg(disp, RA8875_TPCR0, RA8875_TPCR0_DISABLE);
  }
}

/**************************************************************************/
/*!
      Checks if a touch event has occured

