uched41/BM-Assist/Central/nRF5_SDK_15.3.0_59ac345/examples/ble_central_and_peripheral/experimental/mindAssist/pca10040/s132/arm5_no_packs/ra8875.c
      @returns  True is a touch event has occured (reading it via
                touchRead() will clear the interrupt in memory)
*/
/**************************************************************************/
bool touched(ra8875_t* disp)
{
  if (readReg(disp, RA8875_INTC2) & RA8875_INTC2_TP) return true;
  return false;
}

/**************************************************************************/
/*!
      Reads the last touch event

      @args x[out]  Pointer to the uint16_t field to assign the raw X value
      @args y[out]  Pointer to the uint16_t field to assign the raw Y value

      @note Calling this function will clear the touch panel interrupt on
            the RA8875, resetting the flag used by the 'touched' function
*/
/**************************************************************************/
bool touchRead(ra8875_t* disp, uint16_t *x, uint16_t *y)
{
  uint16_t tx, ty;
  uint8_t temp;

  tx = readReg(disp, RA8875_TPXH);
  ty = readReg(disp, RA8875_TPYH);
  temp = readReg(disp, RA8875_TPXYL);
  tx <<= 2;
  ty <<= 2;
  tx |= temp & 0x03;        // get the bottom x bits
  ty |= (temp >> 2) & 0x03; // get the bottom y bits

  *x = tx;
  *y = ty;

  /* Clear TP INT Status */
  writeReg(disp, RA8875_INTC2, RA8875_INTC2_TP);

  return true;
}

/**************************************************************************/
/*!
      Turns the display on or off
*/
/**************************************************************************/
void displayOn(ra8875_t* disp, bool on)
{
 if (on)
   writeReg(disp, RA8875_PWRR, RA8875_PWRR_NORMAL | RA8875_PWRR_DISPON);
 else
   writeReg(disp, RA8875_PWRR, RA8875_PWRR_NORMAL | RA8875_PWRR_DISPOFF);
}

/**************************************************************************/
/*!
    Puts the display in sleep mode, or disables sleep mode if enabled
*/
/**************************************************************************/
void sleep(ra8875_t* disp, bool sleep)
{
 if (sleep)
   writeReg(disp, RA8875_PWRR, RA8875_PWRR_DISPOFF | RA8875_PWRR_SLEEP);
 else
   writeReg(disp, RA8875_PWRR, RA8875_PWRR_DISPOFF);
}

/************************* Low Level ***********************************/

/**************************************************************************/
/*!

*/
/**************************************************************************/
void  writeReg(ra8875_t* disp, uint8_t reg, uint8_t val)
{
  writeCommand(disp, reg);
  writeData(disp, val);
}

/**************************************************************************/
/*!

*/
/**************************************************************************/
uint8_t  readReg(ra8875_t* disp, uint8_t reg)
{
  writeCommand(disp, reg);
  return readData(disp);
	
	/*uint8_t dat[4];
	dat[0] = RA8875_CMDWRITE;
	dat[1] = reg;
	dat[2] = RA8875_DATAREAD;
	dat[3] = 0x0;
	
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, dat, 4, m_rx_buf, 4));
	NRF_LOG_INFO("data: 0x%02X 0x%02X 0x%02X  0x%02X", m_rx_buf[0], m_rx_buf[1], m_rx_buf[2], m_rx_buf[3]);
	return m_rx_buf[0];*/
}

/**************************************************************************/
/*!

*/
/**************************************************************************/
void  writeData(ra8875_t* disp, uint8_t d)
{
	uint8_t dat[2];
	dat[0] = RA8875_DATAWRITE;
	dat[1] = d;
	
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, dat, 2, m_rx_buf, 2));
}

/**************************************************************************/
/*!

*/
/**************************************************************************/
uint8_t  readData(ra8875_t* disp)
{
	memset(m_rx_buf, 0, 2);
	
	uint8_t dat[2];
	dat[0] = RA8875_DATAREAD;
	dat[1] = 0x0;
	
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, dat, 2, m_rx_buf, 2));
	
  return m_rx_buf[1];
}

/**************************************************************************/
/*!

*/
/**************************************************************************/
void  writeCommand(ra8875_t* disp, uint8_t d)
{	
	uint8_t dat[2];
	dat[0] = RA8875_CMDWRITE;
	dat[1] = d;
	
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, dat, 2, m_rx_buf, 2));
}

/**************************************************************************/
/*!

*/
/**************************************************************************/
uint8_t  readStatus(ra8875_t* disp)
{
	memset(m_rx_buf, 0, 2);
	
	uint8_t dat[2];
	dat[0] = RA8875_CMDREAD;
	dat[1] = 0x0;
	
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, dat, 2, m_rx_buf, 2));
	
  return m_rx_buf[1];
}


#endif



